old/simulationCHT/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    tube_inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    tube_outlet
    {
        type            zeroGradient;
    }

    shell_inlet
    {
        type            fixedValue;
        value           uniform (-1 0 0);
    }
    shell_outlet
    {
        type            zeroGradient;
    }

    shell_wall
    {
        type            noSlip;
    }
}

// ************************************************************************* //
