old/simulationCHT/0/tube_fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/tube_fluid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    tube_inlet
    {
        type            calculated;
        value           uniform 0;
    }
    tube_outlet
    {
        type            calculated;
        value           uniform 0;
    }
    tube_fluid_to_shell_fluid
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
