old/simulationCHT/0/shell_fluid/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/shell_fluid";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.00754;

boundaryField
{
    shell_outlet
    {
        type            calculated;
        value           uniform 0.00754;
    }
    shell_wall
    {
        type            epsilonWallFunction;
        value           uniform 0.00754;
    }
    shell_inlet
    {
        type            fixedValue;
        value           uniform 0.00754;
    }
    shell_fluid_to_tube_fluid
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
